#!/usr/bin/env python

print("Задача: Дано ненульові натруральні числа A, B та C. Обчислити сумму перших цифр цих чисел, отримавши їх за допомогою\nвизначеної функції. ")
print("=" * 119)

# визначення функцій
def firstDigit(n): #функція знаходження першї цифри числа
	while(n > 9):
		 n //= 10
	return n

# введення данних
a = int(input("Введіть число A: "))
b = int(input("Введіть число B: "))
c = int(input("Введіть число C: "))

# розрахунок і виведення результату
print("==============================================================")

if(a < 0 or b < 0 or c < 0):
	print("Помилка: За умовою всі числа повинні бути додатніми")
else:
	print("Суми перших цифр з чисел A, B та C дорівнюе: " + str(firstDigit(a) + firstDigit(b) + firstDigit(c)));

